In [1]:
import pandas as pd

In [2]:
df_vehicle = pd.read_excel("../dataset/df_vehicle.xlsx")
df_vehicle.head(5)

   vehiculo_id  capacidad_kg  costo_km  autonomia_km
0            1          2026      0.20           603
1            2          4362      0.14           630
2            3          4881      0.20           664
3            4          3321      0.19           514
4            5         10000      0.32           350

In [3]:
df_vehicle.isna().sum()

vehiculo_id     0
capacidad_kg    0
costo_km        0
autonomia_km    0
dtype: int64

In [4]:
df_vehicle.dtypes

vehiculo_id       int64
capacidad_kg      int64
costo_km        float64
autonomia_km      int64
dtype: object

In [5]:
df_vehicle.describe().T

,count,mean,std,min,25%,50%,75%,max
vehiculo_id,6.0,3.500000,1.870829,1.00,2.2500,3.500,4.75,6.00
capacidad_kg,6.0,4619.833333,2818.453577,2026.00,3177.0000,3841.500,4751.25,10000.00
costo_km,6.0,0.198333,0.065853,0.14,0.1525,0.195,0.20,0.32
autonomia_km,6.0,592.000000,148.995302,350.00,536.2500,616.500,655.50,791.00